"""
***********************************************************
***             Лабораторна робота №5                  ***
***          з курсу "Основи програмування              ***
***              на скриптових мовах"                   ***
***                   Варіант №7                       ***
***     Виконав:студент Головачук С.В.   Група ТІ-72    ***
***********************************************************
"""

n=int(input('Введіть число n (n>1):'))
k=0
m=int(input('Введіть m (передбачувана межа ітерацій):'))
while(n!=1):
    if(n%2==0):
        n/=2
    else:
        n = n*3 + 1
    k+=1

if(k>m):
    print('Процес завершився за',k,'ітерацій, тобто більше ніж за передбачуване',m)
else:
    print('Процес завершився за',k,'ітерацій, тобто менше ніж за передбачуване', m)

#https://stackoverflow.com/questions/30759686/modifying-a-matrix-using-nested-list-comprehension-in-python